blazemeter-test-fordvirtualshowroom.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: fordshowroom-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: fordshowroom-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  fordshowroom-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1680,843)
      - go(https://d324toaay14uzn.cloudfront.net/index.htm)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)
      - clickByXPath(//div[2]/div[2]/div/div/div/div[2]/div/div/div[3]/div[2]/div/div/div)

  fordshowroom-Http:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.80 Safari/537.36'
      Accept: '*/*'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/f/2/0_0.jpg'
            method: GET
            label: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/f/2/0_0.jpg'
            headers: {}
            body:
              v: '1602154785619'
          - url: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/l/2/0_0.jpg'
            method: GET
            label: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/l/2/0_0.jpg'
            headers: {}
            body:
              v: '1602154785619'
          - url: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/b/2/0_0.jpg'
            method: GET
            label: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/b/2/0_0.jpg'
            headers: {}
            body:
              v: '1602154785619'
          - url: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/u/2/0_0.jpg'
            method: GET
            label: 'https://d324toaay14uzn.cloudfront.net/media/panorama_1760E572_0660_F253_4175_363EF30E77C2_0/u/2/0_0.jpg'
            headers: {}
            body:
              v: '1602154785619'